{
    "Projects": [
        {
            "Title": "Machine Learning for Bioacoustic Classification",
            "Blurb": [
                "This was completed as part of the UTAS Dean's Summer Research Program. The main objective of the project was to investigate the efficacy of the binary relevance technique for multi-label classification, and assess the adequacy of the initial training data that had been acquired for the project. The project involved training machine learning models (CNNs) on acoustic recordings, and Python scripts were developed to process JSON label files, as well as automate the extraction of individual call segments from long WAV files."
            ],
            "ThumbnailType": "Static Image",
            "ThumbnailLink": "/projects/allProjects/ecoacoustics/assets/EcoacousticsThumbail.jpg",
            "Link": "/projects/allProjects/ecoacoustics/",
            "Featured": true
        },

        {
            "Title": "Novel Reinforcement Learning Algorithm",
            "Blurb": [
                "Undertaken as part of UTAS KAA308, this project focussed on implementing a novel reinforcement algorithm (invented by my supervisor for the project). The project focussed on the DMP protocol of the Morris watermaze experiment and the new algorithm aimed to facilitate goal-independent learning with environment obstacles using a model-free approach.",

                "Note that the screen recording to the right shows the progression of an existing algorithm in the environment developed for the project."
            ],
            "ThumbnailType": "Video",
            "ThumbnailLink": "/projects/allProjects/generalisedCoordinateLearning/assets/GeneralisedCoordinateLearningThumbnail.mp4",
            "Link": "/projects/allProjects/generalisedCoordinateLearning/",
            "Featured": true
        },

        {
            "Title": "Vehicular RL with Custom Environment Editor",
            "Blurb": [
                "Most custom reinforcement learning environments are implemented using a physics or game engine. However, I prefer to implement my environments 'from scratch', and that's what I've done here. The project features an environment editor allowing custom road networks to be constructed from straight and curved segments, as well as T-intersections and cross-intersections. The agent learns using the DDPG algorithm (an off-policy actor-critic algorithm designed for continuous action spaces). I am working on converting this into a multi-agent learning environment (MARL)."
            ],
            "ThumbnailType": "Video",
            "ThumbnailLink": "/projects/allProjects/vehicleRL/assets/VehicleRLThumbnail.mp4",
            "Link": "/projects/allProjects/vehicleRL/",
            "Featured": true
        },

        {
            "Title": "Chess Emulator with MiniMax Algorithm",
            "Blurb": [
                "This began as my final project for KIT101 (Programming Fundamentals). I wrote the emulator in Java and implemented a GUI using the swing graphics library. A key part of the project was the AI 'bot' that used the MiniMax algorithm AI bot was implemented using the MiniMax algorithm to calculate pseudo-optimal moves. To speed-up the algorithm, I implemented in alpha-beta pruning and multithreading."
            ],
            "ThumbnailType": "Video",
            "ThumbnailLink": "/projects/allProjects/chess/assets/ChessThumbnail.mp4",
            "Link": "/projects/allProjects/chess/",
            "Featured": true
        },

        {
            "Title": "RC Mini Motorbike",
            "Blurb": [
                "This was a four-week holiday project that I undertook during the 2024 inter-semester break. I designed the (theoretically) self-balancing remote-control motorbike from the ground-up, which included counter-rotating and counter-tilting flywheels, inspired by the Brennan monorail and designed to balance the bike. Ultimately, the bike could not achieve a sustained balance (likely because the flywheels' tilting system did not include a feedback mechanism). A dramatic point in the project was when the flywheels exploded."
            ],
            "ThumbnailType": "Static Image",
            "ThumbnailLink": "/projects/allProjects/RCMotorbike/assets/RCBikeThumbnail.jpg",
            "Link": "/projects/allProjects/RCMotorbike/",
            "Featured": false
        },

        {
            "Title": "createt Designs",
            "Blurb": [
                "3D printing has been a hobby of mine for the past few years. I publish my designs under the online alter ego 'createt', and have amassed over 150,000 views, over 10,000 downloads, thousands of likes, and hundreds of sales. I specialise in making unique novelty items, especially those with mechanical components."
            ],
            "ThumbnailType": "Video",
            "ThumbnailLink": "/projects/allProjects/createt/assets/createtThumbnail.mp4",
            "Link": "/projects/allProjects/createt/",
            "Featured": false
        },

        {
            "Title": "NaviMate - Browser Extension",
            "Blurb": [
                "NaviMate is a browser extension that automatically bookmarks users' last scroll position on webpages, and allows users to add their own bookmarks. Features include an app-style GUI created using vanilla HTML+CSS+JS, options to stop bookmarking specific pages or sites, a settings page, and an embedded feedback-collection form."
            ],
            "ThumbnailType": "Static Image",
            "ThumbnailLink": "/projects/allProjects/NaviMate/assets/NaviMateThumbnail.jpg",
            "Link": "/projects/allProjects/NaviMate/",
            "Featured": false
        },

        {
            "Title": "FlappyBird in Java",
            "Blurb": [
                "The main component of this project was a tutorial on the Java swing graphics API, and the game itself was used as motivation for the tutorial."
            ],
            "ThumbnailType": "Video",
            "ThumbnailLink": "/projects/allProjects/flappyBird/assets/FlappyBirdThumbnail.mp4",
            "Link": "/projects/allProjects/flappyBird/",
            "Featured": false
        },

        {
            "Title": "Procedural 3D Animation",
            "Blurb": [
                "This was my final assignment for KIT307 (Computer Graphics and Animation: Principles and Programming); one of my favourite units at UTAS. Everything is in the animation is generated procedurally in code. This includes meshes, all animations, mesh deformations (skinning), and textures. The animation was selected for exhibition in the UTAS School of ICT Connect & Collaborate Expo."
            ],
            "ThumbnailType": "Video",
            "ThumbnailLink": "/projects/allProjects/MinionsProceduralAnimation/assets/MinionsProceduralAnimationThumbnail.mp4",
            "Link": "/projects/allProjects/MinionsProceduralAnimation/",
            "Featured": false
        },

        {
            "Title": "Automated Graphical Cricket Summaries",
            "Blurb": [
                "I volunteer to compile my cricket club's weekly 'weekend wrap'; a graphical summary of each game played over the weekend. The 'wrap' consists of key details from each game including the top three bowlers and batters, team scores, and opposition team. Ordinarily, its compilation would involve manually sifting through scorecards and copying stats into a Canva design. My idea was to automate this process using a Python script to automatically pull and extract the stats from a webpage, and copy them into a PowerPoint file. The final script drastically reduced the requisite time to complete the wraps."
            ],
            "ThumbnailType": "Static Image",
            "ThumbnailLink": "/projects/allProjects/weekendWrap/assets/thumbnail.jpg",
            "Link": "/projects/allProjects/weekendWrap",
            "Featured": true
        }
    ]
}